#### AddConstraintSagittaLength Method

---

|  |
| --- |
| RebarShapeDefinitionByArc Class   See Also |

Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public void AddConstraintSagittaLength( 	ElementId paramId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddConstraintSagittaLength ( _ 	paramId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddConstraintSagittaLength( 	ElementId^ paramId ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().

# Remarks

The sagitta will be measured on the centerline of the bar.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace